{
    "layout": "speaker.njk",
    "page": {
        "title": "ServerlessDays ANZ - Michael Walmsley",
        "description": "There’s been an explosion of “serverless” offerings over the last 8 years. From FaaS and managed services, to “serverless containers”, to the serverless database space race, and most recently, the ridiculous “serverless” branding of services like Amazon Neptune and OpenSearch.\r\n\r\nThe debate over what is, or what is not, serverless is sure to rage on, but arguing the nuances of purity will continue to be lost on many, and ignored by most. And maybe that’s okay. The truth is that it doesn’t matter what we call these services because, in the real world, people just want to get things done using the incredible power of the public cloud. The better question is: how well do these services fit into workflows that maximize developer productivity to rapidly create value for end users?\r\n\r\nIn this talk, we’ll discuss why developer experience is so important, and how it’s a much better indicator of “serverlessness” than simple litmus tests or marketing spin.",
        "url": "https://serverlessdays.io/speakers/michael",
        "image": "https://sessionize.com/image/bd2c-400o400o2-fd-880f-443e-8165-36d90a310365.2d119cd1-e581-4cfc-b40f-3bb884362040.jpg"
    },
    "speaker": {
        "name": "Michael Walmsley",
        "title": "Serverless Architect, Accenture",
        "img": "https://sessionize.com/image/68eb-200o200o2-Ly6ZdgnZKm7rM7B7H4M5i6.png",
        "bio": "Michael has been delivering Serverless Solutions to production for five years and works with the myWizard AiOps team at Accenture, building and accelerating Serverless teams. He is an AWS Community builder in Melbourne, co-hosting the AWS Programming and Tools Meetup.",
        "social": [
            {
                "name": "Twitter",
                "link": "https://twitter.com/walmsles",
                "icon": "https://res.cloudinary.com/serverlessdays/image/upload/v1560336697/Twitter.svg"
            },
            {
                "name": "LinkedIn",
                "link": "https://linkedin.com/in/walmsles",
                "icon": "https://res.cloudinary.com/serverlessdays/image/upload/c_scale,h_80/v1560755840/linkedin_white.png"
            }
        ],
        "links": [
            {
                "text": "",
                "link": ""
            }
        ]
    }
}